/*
 * E5.c
 * v0
 * 16.07.24
 *
 * Считать массив из 10 элементов и посчитать сумму положительных элементов массива.
 * Формат входных данных
 * 10 целых чисел через пробел.
 * Формат результата
 * Одно целое число - сумма положительных элементов массива
 *
 */


#include <stdio.h>

enum {SIZE=10}; //размер массива
int A[SIZE];

void input(int A[],int SIZE);

int sum_pos(int A[], int SIZE);

//=============================================================================================================================

int main(int argc, char **argv)
{

    input(A,SIZE);

    printf("%d",sum_pos(A,SIZE));

    return 0;
}

//=============================================================================================================================

void input(int A[],int SIZE) //ФУНКЦИЯ ввода массива
{
    for (int i=0; i<SIZE; i++)
        scanf("%d",&A[i]);
}


int sum_pos(int A[], int SIZE) //ФУНКЦИЯ - сумма положительных чисел
{
    int sum_p =0;

    for (int i=0; i<SIZE; i++)
    {

        if( A[i] > 0 )
        {
            sum_p += A[i];
        }

    }
    return sum_p;
}


