/*
 * E6.c
 * v0
 * 16.07.24
 *
 * Считать массив из 12 элементов и посчитать среднее арифметическое элементов массива.
 * Формат входных данных
 * 12 целых чисел через пробел
 * Формат результата
 * Среднее арифметическое в формате "%.2f"
 *
 */


#include <stdio.h>

enum {SIZE=12}; //размер массива
int A[SIZE];

void input(int A[],int SIZE);

float mid(int A[], int SIZE);

//=============================================================================================================================

int main(int argc, char **argv)
{

    input(A,SIZE);

    printf("%.2f",mid(A,SIZE));

    return 0;
}

//=============================================================================================================================

void input(int A[],int SIZE) //ФУНКЦИЯ ввода массива
{
    for (int i=0; i<SIZE; i++)
        scanf("%d",&A[i]);
}


float mid(int A[], int SIZE) //ФУНКЦИЯ - среднее ариф
{
    int sum =0;

    for (int i=0; i<SIZE; i++)
    {
        sum += A[i];
    }
    return (float)sum/SIZE;
}


