/*
 * A4.c
 * v0
 * 23.06.24
 * Формат входных данных
   Три целых числа через пробел. 
 * 
 * Формат результата
    Строка вида
    %d+%d+%d=%d
    %d*%d*%d=%d  
 * 
 */


#include <stdio.h>

int main(int argc, char **argv)

{
	int IN[3]  = {0,0,0};      //входные данные
    int OUT[2] = {0,0};       //результат
    
    scanf("%d %d %d",&IN[0],&IN[1],&IN[2]);  //считывание входных данных
    
    OUT[0] = IN[0]+IN[1]+IN[2]; //расчет суммы
    OUT[1] = IN[0]*IN[1]*IN[2]; //расчет произведения
                
    printf("%d+%d+%d=%d\n",IN[0],IN[1],IN[2],OUT[0]); //вывод
    printf("%d*%d*%d=%d\n",IN[0],IN[1],IN[2],OUT[1]);
    
	return 0;
}

